#! /bin/bash
#单个一般字符
#搜索含有字符"a"的文本行
# str=`grep "a" note.txt`
# echo "$str"
# echo "==============================="
# #转义后的元字符
# #搜索含有字符"."的文本行
# str=`grep "\." note.txt`
# echo "$str"

#匹配多个字符
# echo "==============================="
# #搜索字符串"grep"
# str=`grep "grep" note.txt`
# echo "$str"
echo "==============================="
#匹配含有字符"o",后面紧跟着字符"r"或者"u"的文本行
str=`grep "o[ru]" version.txt`
echo "$str"

echo "================================"
#匹配任意多个字符"o"
str=`grep "lo*king" version.txt`
echo "$str"

echo "================================"
#筛选符合格式的电话号码
str=`egrep "800-[[:digit:]]{3}-[[:digit:]]{4}$" ../test/phone.txt`
echo "$str"


echo "================================"
#筛选以3个数字开头的文本行
str=`egrep "^[[:digit:]]{3}" ../test/phone.txt`
echo "$str"
echo "================================"
#筛选以4个数字结尾的文本行
str=`egrep "[[:digit:]]{4}$" ../test/phone.txt`
echo "$str"

# #子表达式
# #通过正则表达式定位所有的2个连续的HTML空格符
# str=`egrep "(&nbsp;){2}" html.txt`
# echo "$str"

echo "================================"
#匹配IP地址
str=`egrep "^([[:digit:]]{1,3}\.){3}[[:digit:]]{1,3}$" ../test/ip.txt`
echo "$str"
echo "================================"
#匹配合法IP地址
str=`egrep "^([0-9]{1,2}|1[0-9]{2}|2[0-4][0-9]|25[0-5])\.([0-9]{1,2}|1[0-9]{2}|2[0-4][0-9]|25[0-5])\.([0-9]{1,2}|1[0-9]{2}|2[0-4][0-9]|25[0-5])\.([0-9]{1,2}|1[0-9]{2}|2[0-4][0-9]|25[0-5])$" ../test/ip.txt`
echo "$str"








echo "结束状态:$?"
